# 1. Пользователь вводит данные о количестве предприятий, их наименования и прибыль за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.. Программа должна определить среднюю прибыль (за год для всех предприятий) и вывести наименования предприятий, чья прибыль выше среднего и отдельно вывести наименования предприятий, чья прибыль ниже среднего.
import statistics


# чтобы не мучать себя инпутами, закоментируйте функцию пользовательского ввода company_data и раскоментируйте блок test data
# ========================================
# company_data
# ========================================
def company_data():
    n_c = input("кол-во организаций: ")
    s = {}
    for i in range(int(n_c)):
        name = input('название организации: ')
        values = input('введите 4 значения через пробел: ').split()
        s.update({name: list(map(int, values))})
    return s

company = company_data()
# ========================================


# ========================================
# test data
# ========================================
# company = {
#     "gazmjas": [20,15, 12, 17],
#     "uhafish": [10,23, 17, 16],
#     "store":   [23,16, 14, 11],
#     "general_store": [20,25, 10, 15]
# }
# ========================================

arr = []

for i in company:
    arr.append((i, statistics.mean(company[i])))

arr_avg = statistics.mean(map(lambda i: i[1] , arr))

eq_value = []
highest = []
lowest = []

for i in arr:
    if i[1] == arr_avg:
        eq_value.append(i)
    elif i[1] < arr_avg:
        lowest.append(i),
    else:
        highest.append(i)

print("среднее значение: ", arr_avg)
print("прибыль ниже среднего значения: ", lowest)
print("прибыль выше среднего значения: ", highest)